lab2-soap/dsgt-soap/requesttype.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gs="http://foodmenu.io/gt/webservice">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getMealsByTypeRequest>
            <gs:mealtype>meat</gs:mealtype>
        </gs:getMealsByTypeRequest>
    </soapenv:Body>
</soapenv:Envelope>